Revit 2026 API
AppearanceAssetElement.Duplicate Method
 Duplicates the appearance asset element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public AppearanceAssetElement Duplicate(
	string name
)
Public Function Duplicate (
	name As String
) As AppearanceAssetElement
public:
AppearanceAssetElement^ Duplicate(
	String^ name
)
member Duplicate :
        name : string -> AppearanceAssetElement
Parameters
name String
 Name of the new appearance asset element - this name must be correctly structured for Revit use and not duplicate the name of another appearance asset in the document.
Return Value
AppearanceAssetElement
 The new AppearanceAssetElement.
Exceptions
Exception | Condition
ArgumentException |  name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as an appearance asset name.
ArgumentNullException |  A non-optional argument was null
Remarks
 The asset contained by this element will be duplicated as well. Changes to the duplicated element or its asset do not affect the original element and asset.
See Also
Reference
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace